app/controllers/events_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "events" ("created_at", "date", "place", "time", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Tue, 24 Sep 2013 22:35:52 UTC +00:00], ["date", nil], ["place", nil], ["time", nil], ["updated_at", Tue, 24 Sep 2013 22:35:52 UTC +00:00], ["user_id", 1]]
---
	def create
		@user = User.find(params[:user_id])
		@event = @user.events.create(params[:event])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "events".* FROM "events" INNER JOIN "guest_lists" ON "events"."id" = "guest_lists"."event_id" WHERE "guest_lists"."user_id" = 1
---
	def index
		@user = User.find(params[:user_id])
		@events = @user.events.all