app/controllers/guest_lists_controller.rb

  def new
  	@event = Event.find(params[:event_id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "12"]]

  def show
  	@event = Event.find(params[:event_id])
  	@user_infos = @event.users.pluck([:first_name, :last_name, :phone, :email])

  	@guest_raw_datas = GuestList.select("user_id").where(params[:event_id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", :event_id]]
SELECT first_name, last_name, phone, email FROM "users" INNER JOIN "guest_lists" ON "users"."id" = "guest_lists"."user_id" WHERE "guest_lists"."event_id" = 12
SELECT user_id FROM "guest_lists" WHERE (12)

  def create
  	# ["2","3"]
  	#render text: params
  	# render text: params[:guest_list][:user_id].reject!{|a| a==""}
	@guest_users = params[:guest_list][:user_id].reject!{|a| a==""}

  	@guest_users.each do |guest_user|
  		GuestList.create(user_id: guest_user, event_id: params[:event_id])
---
INSERT INTO "guest_lists" ("created_at", "event_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Wed, 25 Sep 2013 22:00:27 UTC +00:00], ["event_id", 12], ["updated_at", Wed, 25 Sep 2013 22:00:27 UTC +00:00], ["user_id", nil]]