app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "encrypted_password", "first_name", "last_name", "phone", "salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
  	@user = User.new(params[:user])
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "events".* FROM "events" INNER JOIN "guest_lists" ON "events"."id" = "guest_lists"."event_id" WHERE "guest_lists"."user_id" = 1
---
  def show
  	@user = User.find(params[:id])
    @events = @user.events.all